Masmiseim36/nxpSDK/boards/twrke18f/demo_apps/mc_bldc/pin_mux.h
/*
 * Copyright 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTD17 (number 20), DRV_OC
  @{ */
#define PINTOOL_FTM_DRV_OC_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_FTM_DRV_OC_PIN 17U    /*!<@brief PORTD pin index: 17 */
                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_FTM(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_SPI(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_UART(void);

/*! @name PORTC9 (number 55), USER_LED
  @{ */
#define PINTOOL_MISC_USER_LED_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define PINTOOL_MISC_USER_LED_PORT PORTC /*!<@brief PORT device name: PORTC */
#define PINTOOL_MISC_USER_LED_PIN 9U     /*!<@brief PORTC pin index: 9 */
                                         /* @} */

/*! @name PORTA15 (number 83), DRV_EN
  @{ */
#define PINTOOL_MISC_DRV_EN_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define PINTOOL_MISC_DRV_EN_PORT PORTA /*!<@brief PORT device name: PORTA */
#define PINTOOL_MISC_DRV_EN_PIN 15U    /*!<@brief PORTA pin index: 15 */
                                       /* @} */

/*! @name PORTD3 (number 70), SW2
  @{ */
#define PINTOOL_MISC_SW2_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define PINTOOL_MISC_SW2_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_MISC_SW2_PIN 3U     /*!<@brief PORTD pin index: 3 */
                                    /* @} */

/*! @name PORTE5 (number 8), DRV_RST
  @{ */
#define PINTOOL_MISC_DRV_RST_GPIO GPIOE /*!<@brief GPIO device name: GPIOE */
#define PINTOOL_MISC_DRV_RST_PORT PORTE /*!<@brief PORT device name: PORTE */
#define PINTOOL_MISC_DRV_RST_PIN 5U     /*!<@brief PORTE pin index: 5 */
                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_Misc(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
